Revit 2027 API
FabricationPart.IsAHanger Method
 Checks whether it is a hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAHanger()
Public Function IsAHanger As Boolean
public:
bool IsAHanger()
member IsAHanger : unit -> bool
Return Value
Boolean
 True if the part is a hanger. False otherwise.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace